In [2]:
import pandas as pd
import numpy as np

- As a part of numpy we use arrays
- As a part of Pandas the basic data structure that we use are series and pandas
- Series is like a one dimensional array

In [16]:
dict_1={'Name':['Subhan','Sumair','Saketh','Shiva','Pavan'],
       'Qualification':['B.tech','B.com','M.tech','MBBS','Phd']}
print(dict_1)

{'Name': ['Subhan', 'Sumair', 'Saketh', 'Shiva', 'Pavan'], 'Qualification': ['B.tech', 'B.com', 'M.tech', 'MBBS', 'Phd']}

In [4]:
pip show pandas

Name: pandas
Version: 2.2.3
Summary: Powerful data structures for data analysis, time series, and statistics
Home-page: https://pandas.pydata.org
Author:
Author-email: The Pandas Development Team <pandas-dev@python.org>
License: BSD 3-Clause License

 Copyright (c) 2008-2011, AQR Capital Management, LLC, Lambda Foundry, Inc. and PyData Development Team
 All rights reserved.

 Copyright (c) 2011-2023, Open source contributors.

 Redistribution and use in source and binary forms, with or without
 modification, are permitted provided that the following conditions are met:

 * Redistributions of source code must retain the above copyright notice, this
   list of conditions and the following disclaimer.

 * Redistributions in binary form must reproduce the above copyright notice,
   this list of conditions and the following disclaimer in the documentation
   and/or other materials provided with the distribution.

 * Neither the name of the copyright holder nor the names of its
   contributors may be used to endorse or promote products derived from
   this software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

Location: C:\Users\ipava\anaconda3\Lib\site-packages
Requires: numpy, python-dateutil, pytz, tzdata
Required-by: bokeh, datashader, holoviews, hvplot, panel, seaborn, statsmodels, streamlit, xarray
Note: you may need to restart the kernel to use updated packages.

In [6]:
import pandas as pd
import numpy as np
ser_1= pd.Series([3,5,7,8,9])
print(ser_1)

0    3
1    5
2    7
3    8
4    9
dtype: int64

In [5]:
type(ser_1)

pandas.core.series.Series

In [7]:
cities_1=pd.Series(['Ongole','Hyderbad','Bengaluru','Kolkatha'])
print(cities_1)

0       Ongole
1     Hyderbad
2    Bengaluru
3     Kolkatha
dtype: object

In [13]:
#fetch the element 9 from ser_1
print(ser_1[4])

9

In [15]:
#fetch the elemenst from hyderbad to kolkatha from cities_1
cities_1[1:4]

1     Hyderbad
2    Bengaluru
3     Kolkatha
dtype: object

In [17]:
df_1=pd.DataFrame(dict_1)
df_1

     Name Qualification
0  Subhan        B.tech
1  Sumair         B.com
2  Saketh        M.tech
3   Shiva          MBBS
4   Pavan           Phd

In [18]:
type(df_1)

pandas.core.frame.DataFrame

In [20]:
df_1.columns

Index(['Name', 'Qualification'], dtype='object')

In [24]:
#lets fetch 'Name' column
df_1[['Name']]

     Name
0  Subhan
1  Sumair
2  Saketh
3   Shiva
4   Pavan

In [80]:
#lets create a dictionary with name salary savings and designations
#Each key should contain 5 values
import pandas as pd
em=pd.DataFrame({'Name':['Pavan','Malika','Tanuja','Shamu','Divya'],
        'Designation':['Manager','Team lead','Developer','Tester','Customer Support'],
        'Salary':[50000,45000,40000,25000,20000],
        'Savings':[25000,15000,10000,5000,2500]})
em

     Name       Designation  Salary  Savings
0   Pavan           Manager   50000    25000
1  Malika         Team lead   45000    15000
2  Tanuja         Developer   40000    10000
3   Shamu            Tester   25000     5000
4   Divya  Customer Support   20000     2500

In [81]:
#now fetch designation and salary coloums at a time
em[['Designation','Salary']]

        Designation  Salary
0           Manager   50000
1         Team lead   45000
2         Developer   40000
3            Tester   25000
4  Customer Support   20000

In [82]:
#Using Salary and Saving coloums, Lets create a new column Expenditure
#Expenditure =Salary -Savings
em['Expenditure'] =em['Salary']-em['Savings']
em

     Name       Designation  Salary  Savings  Expenditure
0   Pavan           Manager   50000    25000        25000
1  Malika         Team lead   45000    15000        30000
2  Tanuja         Developer   40000    10000        30000
3   Shamu            Tester   25000     5000        20000
4   Divya  Customer Support   20000     2500        17500

In [83]:
#find what percentage of salary is going into savings and expenditure and add those new columns
em['Saving_percentage']=round(em['Savings']/em['Salary']*100,2)
em

     Name       Designation  Salary  Savings  Expenditure  Saving_percentage
0   Pavan           Manager   50000    25000        25000              50.00
1  Malika         Team lead   45000    15000        30000              33.33
2  Tanuja         Developer   40000    10000        30000              25.00
3   Shamu            Tester   25000     5000        20000              20.00
4   Divya  Customer Support   20000     2500        17500              12.50

In [84]:
em['Expenditure_percentage']=round(100-em['Saving_percentage'],2)
em

,Name,Designation,Salary,Savings,Expenditure,Saving_percentage,Expenditure_percentage
0,Pavan,Manager,50000,25000,25000,50.00,50.00
1,Malika,Team lead,45000,15000,30000,33.33,66.67
2,Tanuja,Developer,40000,10000,30000,25.00,75.00
3,Shamu,Tester,25000,5000,20000,20.00,80.00
4,Divya,Customer Support,20000,2500,17500,12.50,87.50

In [85]:
em['First_Name']=em["Name"]
em

,Name,Designation,Salary,Savings,Expenditure,Saving_percentage,Expenditure_percentage,First_Name
0,Pavan,Manager,50000,25000,25000,50.00,50.00,Pavan
1,Malika,Team lead,45000,15000,30000,33.33,66.67,Malika
2,Tanuja,Developer,40000,10000,30000,25.00,75.00,Tanuja
3,Shamu,Tester,25000,5000,20000,20.00,80.00,Shamu
4,Divya,Customer Support,20000,2500,17500,12.50,87.50,Divya

In [86]:
em.drop('First_Name',axis=1,inplace=True)
em

,Name,Designation,Salary,Savings,Expenditure,Saving_percentage,Expenditure_percentage
0,Pavan,Manager,50000,25000,25000,50.00,50.00
1,Malika,Team lead,45000,15000,30000,33.33,66.67
2,Tanuja,Developer,40000,10000,30000,25.00,75.00
3,Shamu,Tester,25000,5000,20000,20.00,80.00
4,Divya,Customer Support,20000,2500,17500,12.50,87.50

In [87]:
em=em.rename(columns={'Name':'First_Name'})
em

,First_Name,Designation,Salary,Savings,Expenditure,Saving_percentage,Expenditure_percentage
0,Pavan,Manager,50000,25000,25000,50.00,50.00
1,Malika,Team lead,45000,15000,30000,33.33,66.67
2,Tanuja,Developer,40000,10000,30000,25.00,75.00
3,Shamu,Tester,25000,5000,20000,20.00,80.00
4,Divya,Customer Support,20000,2500,17500,12.50,87.50

In [88]:
emp=em
emp

,First_Name,Designation,Salary,Savings,Expenditure,Saving_percentage,Expenditure_percentage
0,Pavan,Manager,50000,25000,25000,50.00,50.00
1,Malika,Team lead,45000,15000,30000,33.33,66.67
2,Tanuja,Developer,40000,10000,30000,25.00,75.00
3,Shamu,Tester,25000,5000,20000,20.00,80.00
4,Divya,Customer Support,20000,2500,17500,12.50,87.50

In [92]:
emp.drop(3,axis=0,inplace=True)
emp

,First_Name,Designation,Salary,Savings,Expenditure,Saving_percentage,Expenditure_percentage
0,Pavan,Manager,50000,25000,25000,50.00,50.00
1,Malika,Team lead,45000,15000,30000,33.33,66.67
2,Tanuja,Developer,40000,10000,30000,25.00,75.00
4,Divya,Customer Support,20000,2500,17500,12.50,87.50

In [93]:
emp.set_index('First_Name',inplace=True)
emp

,Designation,Salary,Savings,Expenditure,Saving_percentage,Expenditure_percentage
First_Name,,,,,,
Pavan,Manager,50000,25000,25000,50.00,50.00
Malika,Team lead,45000,15000,30000,33.33,66.67
Tanuja,Developer,40000,10000,30000,25.00,75.00
Divya,Customer Support,20000,2500,17500,12.50,87.50

In [63]:
#create a new dataFrame
#First_Name
#Last_Name
stu_details=pd.DataFrame({
    'First_name':['Aravind','Shubhan','Abdul','Venkata','Saketh'],
    'Last_name':['Reddy','Shaik','Sumain','Pavan','Aditya'],
    'Qualification':['MBA','B.E','B.Tech','B.Tech','B.Tech']
})
stu_details

  First_name Last_name Qualification
0    Aravind     Reddy           MBA
1    Shubhan     Shaik           B.E
2      Abdul    Sumain        B.Tech
3    Venkata     Pavan        B.Tech
4     Saketh    Aditya        B.Tech

In [65]:
#create a new coloumn 'Full_Name' by using 'First_Name' and 'Last_Name'
stu_details['Full_Name']=stu_details['First_name']+' '+stu_details['Last_name']
stu_details

  First_name Last_name Qualification      Full_Name
0    Aravind     Reddy           MBA  Aravind Reddy
1    Shubhan     Shaik           B.E  Shubhan Shaik
2      Abdul    Sumain        B.Tech   Abdul Sumain
3    Venkata     Pavan        B.Tech  Venkata Pavan
4     Saketh    Aditya        B.Tech  Saketh Aditya

In [69]:
#lets Change The name "Qualification" to "Education"
stu_details=stu_details.rename(columns={'Qualification':'Eductaion'})
stu_details

  First_name Last_name Eductaion      Full_Name
0    Aravind     Reddy       MBA  Aravind Reddy
1    Shubhan     Shaik       B.E  Shubhan Shaik
2      Abdul    Sumain    B.Tech   Abdul Sumain
3    Venkata     Pavan    B.Tech  Venkata Pavan
4     Saketh    Aditya    B.Tech  Saketh Aditya